{"platform": {"80": {"before": ["And already now we have, of course, the.", "Plenty of questions, so let's just continue and that's one that's actually picking up on the question of diversifying the representation of what's in the data set."], "containing": "What would that not eventually boost the data activism that underlies corporate platform economies?", "after": ["So I guess it's.", "So I guess we could just take Leo's question, but just to also relay, Augustin has also elaborated in the chat that it's the question of is this even possible within the surveillance capitalist model?"], "sentiment": {"neg": 0.148, "neu": 0.852, "pos": 0.0, "compound": -0.3089}}, "157": {"before": ["It's going to share my screen.", "And everyone can see this."], "containing": "This keynote is a platform.", "after": ["What does it mean for me as an early career scholar and as a woman of color, to deliver a keynote at this international conference that intersects research theory, art technology, the humanities, creative practice, cultures and communities?", "Today, I'll speak to you about our shared foundation in creative approaches to language through computation, the E list, and I will speak to you about our shared future as we continue to use machines to create alongside us machines that we have trained to echo our ideals about what is true, real and write what is true, what is real, who is right."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "163": {"before": ["At the twenty seventeen conference in Portugal, read O'Reilly's keynote machine writing translation generation and Automation Explorer, writing through it alongside machines as well as machines writing through us.", "She called to do more to quote, bridge the gap between production and consumption, the gap between coding and articulation with reading practices, unquote."], "containing": "So the reason these questions represent our shared future is to develop one platform and also mechanisms, structures and coding and software architectures of the technologies that we use.", "after": ["These questions address smaller scale design and larger multi national corporate production.", "That dictate how these what these technologies will look like, as well as how they potentially represent and leave out certain groups of people, so we had better understand aspects of how these tools are designed and how the paramilitaries are working, essentially."], "sentiment": {"neg": 0.0, "neu": 0.921, "pos": 0.079, "compound": 0.34}}, "328": {"before": ["as creative?", "Frankly, I would have loved to have done Michael Keenan on answering these questions and the research were answering them is only starting."], "containing": "Electronic literature has always been responded to the exclusion of women's voices using machines as platforms.", "after": ["There's that word again, but platforms to raise up and to speak.", "And in many ways, the history of digital storytelling is gendered because the histories of writing and publishing are gendered."], "sentiment": {"neg": 0.128, "neu": 0.872, "pos": 0.0, "compound": -0.296}}, "329": {"before": ["Frankly, I would have loved to have done Michael Keenan on answering these questions and the research were answering them is only starting.", "And to my delight, it's starting with Elliot."], "containing": "There's that word again, but platforms to raise up and to speak.", "after": ["And in many ways, the history of digital storytelling is gendered because the histories of writing and publishing are gendered.", "The Western publishing industry in particular, has a long tradition of shutting out specific voices."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "388": {"before": ["And he answered, We're not there yet.", "The design of algorithms does data and software represents an incredible blind spot of contemporary technology, which is why we humans unions are necessary to to insert inclusive emotional nuance and empathy."], "containing": "The answer is certainly not that we should change all of our assistance voices to the British series Geeves sounding voice, but rather that we should remain critical about what solutions could look like and how we can use our platforms.", "after": ["So here are some thoughts.", "Perhaps we can be stricter about the certification requirements for developing releasing a system Gill's virtual assistant skills."], "sentiment": {"neg": 0.063, "neu": 0.788, "pos": 0.149, "compound": 0.4678}}}, "google": {}, "facebook": {}, "right": {"38": {"before": ["I mean, I have so many questions during the talk and then you answered them all before I could ask them.", "But that's also fine because I'm not here to ask questions."], "containing": "And actually, there was a question right at the beginning of your talk that is now in the top of the chat.", "after": ["And I just relayed in the chat, I'm not sure if if the person who asked the question thinks that it has been answered in the meantime.", "But I just post it again in the chat and we did."], "sentiment": {"neg": 0.0, "neu": 0.917, "pos": 0.083, "compound": 0.2023}}, "58": {"before": ["I think this is partly the strength of his work, and I'll just put it in the chart as well.", "The same question."], "containing": "But the think that's such an important distinction, right, to to be aware of.", "after": ["We have a question as well from them, from bad Brad Gallagher says, and what do you think of purposely biasing language models in other directions of language?", "Models like two or three, based on Internet, based on the Internet, will inevitably be biased towards the white Western male viewpoint at best and for racism and misogyny at worst, since these behaviors are ultimately features led by neural networks but expressed in the weights computed by the training process, what would it mean to proactively change these weights to reflect voices that are traditionally underrepresented?"], "sentiment": {"neg": 0.0, "neu": 0.878, "pos": 0.122, "compound": 0.2023}}, "141": {"before": ["You go check it out.", "I think it's in Flash, in which case you should check out Dinis talk on June 10th, I think."], "containing": "Thank you for all of those answers right on point.", "after": ["I mean, that's just answering everyone.", "So so thanks that it was so inspiring and and such a great keynote and such a great way to start off our panel."], "sentiment": {"neg": 0.0, "neu": 0.783, "pos": 0.217, "compound": 0.3612}}, "159": {"before": ["OK, so, yes, I want to thank you also for the introduction and the organizers for inviting me today and for bringing us all together on the subject of.", "This keynote is a platform."], "containing": "Today, I'll speak to you about our shared foundation in creative approaches to language through computation, the E list, and I will speak to you about our shared future as we continue to use machines to create alongside us machines that we have trained to echo our ideals about what is true, real and write what is true, what is real, who is right.", "after": ["At the twenty seventeen conference in Portugal, read O'Reilly's keynote machine writing translation generation and Automation Explorer, writing through it alongside machines as well as machines writing through us.", "She called to do more to quote, bridge the gap between production and consumption, the gap between coding and articulation with reading practices, unquote."], "sentiment": {"neg": 0.0, "neu": 0.762, "pos": 0.238, "compound": 0.9349}}, "185": {"before": ["And I didn't at the time.", "But having recently spoken to Jamie, now I will."], "containing": "Models trained on a limited corpus contain a limited picture of the world models that are thus an authority on what is considered true, real and right.", "after": ["And while I've heard people compare machine learning datasets to the ways in which children learn by example, by modeling their behavior and utterances after authority figures around them, there is a key difference to how machines learn language and culture compared to children.", "Children develop a sense of emotional nuances over time so that even if they hear a bad word repeatedly, they understand that its contents are harmful or forbidden."], "sentiment": {"neg": 0.131, "neu": 0.727, "pos": 0.142, "compound": 0.0772}}, "278": {"before": ["There are an abundance of official and third party alexiev skills that are designed to unconditionally support a user, including at least 10 skills called Make Me Smile and Make Me Happy and at least seven skills, a compliment or flatter user.", "More explicitly problematic are the skills with the word wife in the invocation name."], "containing": "A punch line, a skill I repeatedly provided sample utterances, which are masculine stereotypes, the three quotes at the top on the right hand side, and Aleksa response.", "after": ["If it will make you happy, then OK. And and no, just kidding, of course.", "So I try my own hyperbolic utterances."], "sentiment": {"neg": 0.0, "neu": 0.821, "pos": 0.179, "compound": 0.6124}}, "294": {"before": ["The premise that compliments towards female identifying and or female presenting subjects should mostly return enthusiastic and positive feedback is both inaccurate but also harmful as a projected socio cultural expectation.", "And finally, the utterance, Alexa is ready to make sandwiches or anything for you super user."], "containing": "It's noteworthy that if told to make a sandwich, Alexis, from the factory utterances and clues, I can't right now.", "after": ["I can't because I don't have any condiments.", "And OK, your sandwich, her retorts that are specific to the Make Me a Sandwich statement reveal that the official developers anticipate anticipated Alexa would encounter it."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "439": {"before": ["Anyway, I'll leave it there.", "So I."], "containing": "Amazon is directly doing right now to add an emotional nuance to Alexa.", "after": ["It's interesting, actually, I think I'm going to agree with Andrew, but for the answer, if I may, I think emotional nuance in terms of emotional intelligence for her own sake is not afforded in that we don't want too much of an Alexa to feel otherwise.", "The people who are emotionally abusive are going to get some retaliation, which is something I would really like."], "sentiment": {"neg": 0.0, "neu": 0.769, "pos": 0.231, "compound": 0.3182}}, "464": {"before": ["She's not autonomous.", "We certainly don't want her to understand, but just do."], "containing": "I cyborg characters in movies, especially sci fi movies, which I won't get into right now.", "after": ["What would it mean, I mean, I think it's a form of retaliation.", "It's the same sort of thing."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "512": {"before": ["Those people are like you want to be special but special such that you can wear new balance shoes every day and special so that you can wear nothing but turtlenecks and make decisions and also not have to worry about.", "Buying groceries on your commute anyway, I could talk about that for a long time, so I will stop that now."], "containing": "And I think there was the only one I can think of right now, and I actually I wish I were interfacing live so that I could be.", "after": ["What are some examples of your thinking of?", "But the one I'm thinking of is one in which a woman was wearing a Fitbit and then wasn't."], "sentiment": {"neg": 0.0, "neu": 0.886, "pos": 0.114, "compound": 0.4019}}, "551": {"before": ["But those rules don't apply to the Avatar version.", "So you have these four girls who have given up their images to."], "containing": "So the the I think this starts to encroach upon the question of AI rights, which is a whole other conversation.", "after": ["But it's not what Jeremy was gesturing toward.", "It made me think about that."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}}, "data": {"78": {"before": ["But thanks and also for the for the different teams, I think that's one of the important things of Q&A tonight is all the different directions it goes into.", "And yeah, and I think we have identified multiple topics for future discussions."], "containing": "Plenty of questions, so let's just continue and that's one that's actually picking up on the question of diversifying the representation of what's in the data set.", "after": ["Christine is asking, diversifying it and aiming at equal representation.", "What would that not eventually boost the data activism that underlies corporate platform economies?"], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "80": {"before": ["And already now we have, of course, the.", "Plenty of questions, so let's just continue and that's one that's actually picking up on the question of diversifying the representation of what's in the data set."], "containing": "What would that not eventually boost the data activism that underlies corporate platform economies?", "after": ["So I guess it's.", "So I guess we could just take Leo's question, but just to also relay, Augustin has also elaborated in the chat that it's the question of is this even possible within the surveillance capitalist model?"], "sentiment": {"neg": 0.148, "neu": 0.852, "pos": 0.0, "compound": -0.3089}}, "83": {"before": ["What would that not eventually boost the data activism that underlies corporate platform economies?", "So I guess it's."], "containing": "So so this makes it data.", "after": ["Activism is in itself a profitable practice that we can critique and then to have more data extraction.", "Right."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "84": {"before": ["So I guess it's.", "So I guess we could just take Leo's question, but just to also relay, Augustin has also elaborated in the chat that it's the question of is this even possible within the surveillance capitalist model?"], "containing": "Activism is in itself a profitable practice that we can critique and then to have more data extraction.", "after": ["Right.", "Is that really the answer?"], "sentiment": {"neg": 0.0, "neu": 0.847, "pos": 0.153, "compound": 0.4404}}, "186": {"before": ["But having recently spoken to Jamie, now I will.", "What we know of machine learning is that generated output is only as diverse as its corpus."], "containing": "And while I've heard people compare machine learning datasets to the ways in which children learn by example, by modeling their behavior and utterances after authority figures around them, there is a key difference to how machines learn language and culture compared to children.", "after": ["Children develop a sense of emotional nuances over time so that even if they hear a bad word repeatedly, they understand that its contents are harmful or forbidden.", "But I admittedly generalized way our sophisticated counting machines and the frequency rather than nuance."], "sentiment": {"neg": 0.0, "neu": 0.97, "pos": 0.03, "compound": 0.0772}}, "190": {"before": ["Children develop a sense of emotional nuances over time so that even if they hear a bad word repeatedly, they understand that its contents are harmful or forbidden.", "But I admittedly generalized way our sophisticated counting machines and the frequency rather than nuance."], "containing": "And in this way, data sets that are shaped after the past, our future, projected and predictive, prescriptive of the future, the past is allowed to shape the future or what Wendy articulates in this way, the future equals the past data sets and thus hold the power to reinforce, self, perpetuate and justify systems of the past in terms of who's in and who's out.", "after": ["So what was in the core message?", "Train rewrites?"], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "217": {"before": ["With the practices of othering coming from a concurrent dominant logic of big tech that is founded upon what I I'll call one of asness.", "So in combination, the dominant logics, logics of big tech exhibit exclusion, discrimination and infliction the opposite ethos of equity, diversity and inclusion."], "containing": "And in my description of a one of US ness, I'm also drawing from a growing body of and work by scholars in science and technology studies, critical data studies, critical race studies, computer science and feminist techno science fields in which has been as pointed focus on critiquing systemic bias and big tech and data algorithms, infrastructures and as a notable texada and cultural organizations in those efforts include those pictured here.", "after": ["So when interacting with A.I.", "and when trying to understand them critically, we shouldn't be asking questions akin to the Turing test as if we're testing for humanity."], "sentiment": {"neg": 0.081, "neu": 0.896, "pos": 0.023, "compound": -0.5106}}, "255": {"before": ["And when we examine AI assistant's utterances, again, we're not looking for intelligence, but rather of efficacy to get the job done.", "And what is it about the design of assistance that keeps their utterances from being creative?"], "containing": "And while the larger data and code architecture of mostly of most commercialized by remains closed source, which means that it's not publicly available.", "after": ["I examined what is available on the access code, the official software developer console through the Alexiev Skills Kids, Amazon's official code samples and snippets of basic Aleksa skills, which we can find on GitHub.", "And the code of a user developed skill on GitHub, I can absolutely offer more information about my methodology and this is the Q&A if people want, but this is a shorter version."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "378": {"before": ["Other projects that I'm writing about that I will continue to write about include when you students recurrent Quere Imagineering, a mixed media art installation featuring a virtual assistant called Model Assistant that generates progressive motto's about politics, gender and sexuality.", "I'm also writing about hatchers and of digital humanoid voices like those of Syria and Lexar, a voice that he performs when reciting his own poetry, allowing him to embody the machine to perform under unfamiliar, deep familiarized circumstances."], "containing": "In future, examinations of our inquiries into their design can provide more ways of knowing more forms of access and greater digital literacy, especially, as I've mentioned, are increasingly commercialized and deliberately made more obtuse as the research of critical code and critical data study is developed.", "after": ["These areas of work as necessary pillars and as creative practices in which literature, art, design actively resist.", "They can also help to shape robust methodologies that we will need to crumble."], "sentiment": {"neg": 0.09, "neu": 0.861, "pos": 0.049, "compound": -0.2732}}, "381": {"before": ["In future, examinations of our inquiries into their design can provide more ways of knowing more forms of access and greater digital literacy, especially, as I've mentioned, are increasingly commercialized and deliberately made more obtuse as the research of critical code and critical data study is developed.", "These areas of work as necessary pillars and as creative practices in which literature, art, design actively resist."], "containing": "Big text, self presentation of objective data, information and logic.", "after": ["However, the goal should not be to make more technology to fix bad technology.", "I asked job applicants already."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "386": {"before": ["I asked job applicants already.", "I said, why can't we just fix the algorithm to recognize emotional nuance?"], "containing": "The design of algorithms does data and software represents an incredible blind spot of contemporary technology, which is why we humans unions are necessary to to insert inclusive emotional nuance and empathy.", "after": ["So perhaps we can provide more user and public facing solutions.", "The answer is certainly not that we should change all of our assistance voices to the British series Geeves sounding voice, but rather that we should remain critical about what solutions could look like and how we can use our platforms."], "sentiment": {"neg": 0.079, "neu": 0.875, "pos": 0.047, "compound": -0.2732}}, "473": {"before": ["Let me just read the end of this.", "I have to change these things to reflect."], "containing": "Corbi but also data sets, period, data set training, data set design.", "after": ["And I'm going to go slightly and I'm in a different direction, but still very much related to questions of systemic bias and technological design.", "And think about the necessity and the absolute capacity to diversify these datasets is just a question of making sure that from the get go that there are structures in place to say you should look for."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "475": {"before": ["So I don't think this is just an issue with language.", "Corbi but also data sets, period, data set training, data set design."], "containing": "And think about the necessity and the absolute capacity to diversify these datasets is just a question of making sure that from the get go that there are structures in place to say you should look for.", "after": ["You should make sure that your training model has six.", "These three, it's in one one and that sort of thing."], "sentiment": {"neg": 0.0, "neu": 0.938, "pos": 0.062, "compound": 0.3182}}, "480": {"before": ["These three, it's in one one and that sort of thing.", "And then some days and the reason I say this is because I've been thinking a lot about facial recognition technology being trained on largely white faces and how to proactively change those weights to reflect people who look different and have different skin tones, different phenotype features, and to make sure that a computer understands that there's more than just one."], "containing": "I think the difficulty is and this is something that Javier gestured toward and saying like this is why humans are still needed, is that when we automate that data since training.", "after": ["And there's nobody, as he does, intervenes to make sure that the output is not going to grow and if there's no monitoring whatsoever, that's the difficulty.", "So I definitely think it's a question of design."], "sentiment": {"neg": 0.071, "neu": 0.855, "pos": 0.074, "compound": 0.0258}}, "484": {"before": ["And there's nobody, as he does, intervenes to make sure that the output is not going to grow and if there's no monitoring whatsoever, that's the difficulty.", "So I definitely think it's a question of design."], "containing": "If data set design had some protocols in place to mandate.", "after": ["Equal representation.", "I think that that would at least be a step toward."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "517": {"before": ["But the one I'm thinking of is one in which a woman was wearing a Fitbit and then wasn't.", "Was unfortunately murdered and that the police were checking with the FBI to monitor her heart rate around the time that that that the incident could have happened."], "containing": "I think in the at least in the examples that I know of, of being used as criminal witnesses, what people are relying on and this is actually an important point, is they're not relying on interfacing elements of surveillance so much as they are the collected data.", "after": ["And that's something that happens behind the scenes, behind the scenes, behind the scenes and the data that they're referring to as the as worthy of witness, as worthy of objective analysis, and in shaping decisions on whether or not someone may be guilty and but but maybe to expand this a little bit more and not think about just assistance.", "I mentioned facial recognition technology earlier and those are often used to identify criminal."], "sentiment": {"neg": 0.069, "neu": 0.894, "pos": 0.037, "compound": -0.3818}}, "518": {"before": ["Was unfortunately murdered and that the police were checking with the FBI to monitor her heart rate around the time that that that the incident could have happened.", "And in that sense, there was no there was no voice based issue there."], "containing": "And that's something that happens behind the scenes, behind the scenes, behind the scenes and the data that they're referring to as the as worthy of witness, as worthy of objective analysis, and in shaping decisions on whether or not someone may be guilty and but but maybe to expand this a little bit more and not think about just assistance.", "after": ["I mentioned facial recognition technology earlier and those are often used to identify criminal.", "Criminals, but like I say that, I think I think I should use the word criminals lightly, because sometimes those people are not criminals and they're just categorized as criminals because of facial recognition mismatches."], "sentiment": {"neg": 0.029, "neu": 0.865, "pos": 0.106, "compound": 0.6059}}, "523": {"before": ["Criminals, but like I say that, I think I think I should use the word criminals lightly, because sometimes those people are not criminals and they're just categorized as criminals because of facial recognition mismatches.", "Or it could just be."], "containing": "I think Brad's question about diversifying or about varying weights and thinking about, again, the need to make sure of that data sets are diverse, as diverse as people.", "after": ["And when it comes then to what the second half of this question about whether or not it would make a difference if they were gendered?", "I don't think so, mostly because I don't think that they would unless I'm mistaken."], "sentiment": {"neg": 0.0, "neu": 0.922, "pos": 0.078, "compound": 0.3182}}, "527": {"before": ["And when it comes then to what the second half of this question about whether or not it would make a difference if they were gendered?", "I don't think so, mostly because I don't think that they would unless I'm mistaken."], "containing": "I think that they just go straight to what's the data that we have?", "after": ["Do we have a recording?", "Do we have like do we if it's all and Alexa Smart home, was there a time of break in where the security system was tampered with and so on and so forth?"], "sentiment": {"neg": 0.0, "neu": 0.863, "pos": 0.137, "compound": 0.2263}}, "558": {"before": ["Yes, the group is called ASBA and.", "Somebody has commented on this."], "containing": "Boost the data back those, I guess, to a degree, the concern there would be that.", "after": ["Collecting data.", "Is at the same time and collecting data to diversify."], "sentiment": {"neg": 0.0, "neu": 0.828, "pos": 0.172, "compound": 0.4019}}, "559": {"before": ["Somebody has commented on this.", "Maybe I'm not."], "containing": "Collecting data.", "after": ["Is at the same time and collecting data to diversify.", "This is actually a really good point that there is a there's a there's that data set."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "560": {"before": ["Maybe I'm not.", "Boost the data back those, I guess, to a degree, the concern there would be that."], "containing": "Is at the same time and collecting data to diversify.", "after": ["This is actually a really good point that there is a there's a there's that data set.", "Diversification is a kind of Genspace, because on the one hand, diversity is good because we don't want technologies that are going to develop anyway to develop and leave people behind."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}, "561": {"before": ["Boost the data back those, I guess, to a degree, the concern there would be that.", "Collecting data."], "containing": "This is actually a really good point that there is a there's a there's that data set.", "after": ["Diversification is a kind of Genspace, because on the one hand, diversity is good because we don't want technologies that are going to develop anyway to develop and leave people behind.", "But on the other, what does that data collection look like?"], "sentiment": {"neg": 0.0, "neu": 0.803, "pos": 0.197, "compound": 0.4927}}, "563": {"before": ["Is at the same time and collecting data to diversify.", "This is actually a really good point that there is a there's a there's that data set."], "containing": "But on the other, what does that data collection look like?", "after": ["Does it look like infringing upon people's privacy?", "Does it look like it eventually is to actually include people that you would be taking people's information with or without their permission?"], "sentiment": {"neg": 0.0, "neu": 0.8, "pos": 0.2, "compound": 0.3612}}, "570": {"before": ["Remains, I think, part of the issue.", "I wonder if there is a way to do it with."], "containing": "They're they're referred to as biodata.", "after": ["Who who does that belong to?", "And actually, that kind of goes into Leo's question, because I've starting to encroach upon sci fi now, thinking about Minority Report all of a sudden."], "sentiment": {"neg": 0.0, "neu": 1.0, "pos": 0.0, "compound": 0.0}}}}